{
  "method_name": "Método Joaquín Vega — Modified Fibonacci Trading Methodology",
  "version": "3.0",
  "generated": "2026-02-25",
  "source_videos": 40,
  "architecture_note": "The method has three layers: (1) Reading Model — cycles, fractality, zones; (2) Attack Model — entry patterns, liquidity grabs; (3) Management Model — partials, stops, risk. 'Modelo de lectura + modelo de ataque + gestión = método completo.' Version 3.0 adds hedging, deception patterns, business plan compliance, drawdown management, context assessment, and null operations trees.",

  "trees": [

    {
      "tree_name": "T1_Cycle_Identification",
      "tree_description": "How to identify, activate, and mark a trading cycle. A cycle requires an impulse from a Point of Control followed by a retracement to 38.2%. Once activated, high/low zones are marked. This is the foundation of the entire reading model. Source: Understanding Fractality, Fractality Practice Example, Evolution of Cycles.",
      "source_videos": ["3ilsV4UU5Y0", "4b2ZAImaATk", "ExKdYnCebqY"],
      "root": {
        "id": "t1_1",
        "question": "Do you have a Point of Control (origin of a significant price movement)?",
        "yes": {
          "id": "t1_2",
          "question": "Has there been an impulse movement from that Point of Control?",
          "yes": {
            "id": "t1_3",
            "question": "Has the price retraced to the 38.2% Fibonacci level of that impulse?",
            "quote_es": "El retroceso es la condición imprescindible para que definamos que efectivamente cuando hay retroceso de ese impulso al 38.2, ahí es el momento en el que podemos marcar todas sus zonas.",
            "yes": {
              "id": "t1_4",
              "action": "ACTIVATE CYCLE: Mark all corresponding zones",
              "explanation": "The cycle is now active. Mark: (1) High Zone — above 61.8% of the impulse, (2) Low Zone — below the retracement area, (3) The 38.2 level as the mid-reference, (4) The 61.8 zone as the working zone, (5) The break level of the cycle. Direction arrows: In downtrend cycles, sell in high zones (61 downwards). In uptrend cycles, buy in low zones (61 upwards). 'Siempre vender en zonas altas, en este caso bajista, 61 hacia abajo, y en este caso alcista, 61 hacia arriba y siempre comprar en las zonas bajas.'",
              "sub_decisions": {
                "id": "t1_4a",
                "question": "Is this an uptrend cycle or downtrend cycle?",
                "yes_label": "Uptrend",
                "no_label": "Downtrend",
                "yes": {
                  "id": "t1_4b",
                  "action": "Mark buy arrows in low zones, sell arrows in high zones. Primary bias is LONG.",
                  "explanation": "In uptrend cycles from a point of control, the primary direction is up. Buy attempts in low zones, with the cycle break level below."
                },
                "no": {
                  "id": "t1_4c",
                  "action": "Mark sell arrows in high zones, buy arrows in low zones. Primary bias is SHORT.",
                  "explanation": "In downtrend cycles, the primary direction is down. Sell attempts in high zones, with the cycle break level above."
                }
              }
            },
            "no": {
              "id": "t1_5",
              "action": "WAIT — No cycle is activated yet",
              "explanation": "Without the 38.2% retracement, you cannot mark zones. The impulse alone is not enough. Continue monitoring for the retracement condition. The price may still be in the impulse phase or forming a different structure."
            }
          },
          "no": {
            "id": "t1_6",
            "action": "WAIT — Monitor for impulse completion",
            "explanation": "A point of control exists but no impulse has formed yet. Watch for price to make a decisive move away from the point of control before expecting a retracement."
          }
        },
        "no": {
          "id": "t1_7",
          "action": "IDENTIFY POINTS OF CONTROL — Look for origins of significant movements",
          "explanation": "Scan the chart for levels where significant price movements originated. These become your Points of Control. Use multiple timeframes. Every map starts with identifying where movements begin. 'Cualquier metodología necesita tener una forma de leer los gráficos. La tenemos a través de los ciclos.'"
        }
      }
    },

    {
      "tree_name": "T2_Fractality_And_Evolution",
      "tree_description": "How cycles evolve or break. Every cycle WILL either break or evolve — this is certain. Understanding when to discard old zones and mark new ones is the core skill. 'Todos los fractales que te dan un ciclo, todos, o se rompen o evolucionan.' Source: Understanding Fractality, Fractality Practice Example, Evolution of Cycles.",
      "source_videos": ["3ilsV4UU5Y0", "4b2ZAImaATk", "ExKdYnCebqY"],
      "root": {
        "id": "t2_1",
        "question": "Has price entered the High Zone or Low Zone of the current cycle?",
        "quote_es": "Si en algún momento el precio entra en zona alta, esta zona de 61 es obvio que no vale, ese 38 es obvio que tampoco vale y esta zona de abajo es obvio que tampoco vale.",
        "yes": {
          "id": "t2_2",
          "action": "IMMEDIATELY DISCARD other zones of this cycle",
          "explanation": "The moment price enters a High Zone: discard the 61 zone, the 38 level, the Low Zone, and the Low Zone break level. Only the High Zone and the High Zone break level remain valid. Vice versa for Low Zone entry. 'Eliminar las marcas que ya no importan.'",
          "then": {
            "id": "t2_3",
            "question": "Does price break through the zone (break level hit)?",
            "yes": {
              "id": "t2_4",
              "action": "CYCLE IS BROKEN — Discard entire cycle, all zones dead",
              "explanation": "The cycle is finished. It broke. It will never serve again. 'Ese ciclo no vale, murió, se acabó, se rompió y ya nunca más va a servir.' Start looking for new Points of Control forming from the breakout movement. Watch for new fractals at the next level.",
              "then": {
                "id": "t2_4a",
                "action": "Look for NEW Points of Control forming from the breakout",
                "explanation": "After a cycle breaks, the breakout movement itself creates new reference points. Monitor these for the formation of a new cycle (impulse + 38.2% retracement)."
              }
            },
            "no": {
              "id": "t2_5",
              "question": "Does price respect the zone and reverse (zone works well)?",
              "yes": {
                "id": "t2_6",
                "question": "Is the resulting movement (from zone reversal) LARGER than the original impulse that defined this cycle?",
                "quote_es": "Ahora el movimiento que se está produciendo es superior al movimiento con el que tú estabas trabajando.",
                "yes": {
                  "id": "t2_7",
                  "question": "Does this new, larger movement retrace to 38.2%?",
                  "yes": {
                    "id": "t2_8",
                    "action": "CYCLE EVOLUTION — Old cycle is obsolete, mark NEW cycle with new zones",
                    "explanation": "This is evolution. The smaller fractal has given way to a larger fractal. The previous cycle, including its point of control, is COMPLETELY DEAD. Mark new zones based on the new, larger impulse. 'La fractalidad menor se está rompiendo porque se están formando fractales mayores. No me quiero quedar con un fractal menor. Quiero trabajar las zonas del fractal mayor.' All previous marks — zones, 38, 61, break levels — are replaced.",
                    "sub_decisions": {
                      "id": "t2_8a",
                      "action": "Mark new High Zone, Low Zone, 38, 61, and break levels based on the new larger impulse",
                      "explanation": "The new cycle's measurements come from the new, larger impulse. This creates bigger zones. You always want to work with the largest active fractal."
                    }
                  },
                  "no": {
                    "id": "t2_9",
                    "action": "WAIT — Evolution is pending but not confirmed",
                    "explanation": "The movement is larger than the previous impulse, which is a warning sign that evolution MAY occur. But until the 38.2% retracement of this new movement happens, the evolution is not confirmed. Continue monitoring. The old cycle zones are already suspect but not formally replaced."
                  }
                },
                "no": {
                  "id": "t2_10",
                  "action": "Zone worked — continue within current cycle framework",
                  "explanation": "The zone reversal produced a movement that is still within the scale of the current cycle. No evolution yet. The cycle remains valid with its current zones. Continue trading the existing framework."
                }
              },
              "no": {
                "id": "t2_11",
                "action": "WAIT — Price is in the zone but hasn't decided. Monitor for break or reversal.",
                "explanation": "Price is lingering in the High/Low zone. It will eventually either break through (cycle death) or reverse (potential evolution). Patience required."
              }
            }
          }
        },
        "no": {
          "id": "t2_12",
          "question": "Is price working the 61.8 zone?",
          "yes": {
            "id": "t2_13",
            "action": "61.8 does NOT trigger evolution — trade normally within the cycle",
            "explanation": "When price works the 61.8 zone, the retracement is still smaller than the original impulse. There is no danger of evolution at this level. The 61.8 zone is a normal working zone within the cycle. 'El 61.8 no afecta al ciclo. Podemos trabajarlo absolutamente pero no afecta a ninguna evolución.'",
            "quote_es": "Cuando este movimiento viene a trabajar 61.8, el retroceso sigue siendo menor que el impulso. Por tanto, no hay problema."
          },
          "no": {
            "id": "t2_14",
            "action": "Price is between zones — WAIT for it to reach a decision zone",
            "explanation": "No action needed. The cycle is active and price hasn't reached any critical zone yet. Monitor and wait."
          }
        }
      }
    },

    {
      "tree_name": "T3_Retracement_Completion",
      "tree_description": "How to determine if a retracement is complete. A retracement is NOT finished until price touches the 130% Fibonacci level. This is critical for knowing when the next impulse (fractal) has begun. Source: Setbacks - Enemy of Novice Traders.",
      "source_videos": ["GrH-mtabADo"],
      "root": {
        "id": "t3_1",
        "question": "Is there an active retracement in progress?",
        "yes": {
          "id": "t3_2",
          "question": "Has price touched the 130% Fibonacci level (measured from the retracement)?",
          "quote_es": "Mientras el precio no haga esto y toque el 130, yo no puedo decir que ese retroceso ha concluido.",
          "yes": {
            "id": "t3_3",
            "action": "RETRACEMENT IS COMPLETE — New impulse of next fractal is confirmed",
            "explanation": "The 130% level means price has fallen below the start of the retracement by a third of its measure. This objectively confirms the retracement is over and a new fractal's impulse is underway. 'Lo que pedimos es que caiga por debajo del inicio del retroceso un tercio de su medida.'"
          },
          "no": {
            "id": "t3_4",
            "question": "Has the retracement deepened (made new highs/lows)?",
            "yes": {
              "id": "t3_5",
              "action": "REMEASURE — Take new Fibonacci measurement from the full retracement",
              "explanation": "If the retracement gets deeper, the 130 level moves. You must remeasure with Fibonacci from the new extent. 'Cuanto más profundo se hace el retroceso, más se queda atrás el 130.' The retracement can continue indefinitely until 130 is touched.",
              "quote_es": "Cojo mi Fibo y lo vuelvo a medir completamente. Desde donde empezó el retroceso, sigo midiendo con mi Fibo. Y fíjate como el 130 cambia de sitio."
            },
            "no": {
              "id": "t3_6",
              "action": "WAIT — Retracement is NOT complete. Do not assume the next impulse has begun.",
              "explanation": "Even if price appears to be moving in the impulse direction, without touching 130, you cannot confirm the retracement is over. The price can still extend the retracement. 'Retracements can be fast or slow. Slow ones take a long time and create confusion. The price can be in this state for as long as it wants until it touches the 130.'"
            }
          }
        },
        "no": {
          "id": "t3_7",
          "action": "No retracement to evaluate — monitor for retracement formation",
          "explanation": "An impulse may be in progress. Wait for the impulse to exhaust and begin retracing."
        }
      }
    },

    {
      "tree_name": "T4_Context_Reading",
      "tree_description": "How to read context from the left side of the chart, evaluate movement origins, and use patterns and liquidity. The reading model positions you on the chart. It tells you WHERE price is likely to go. Source: Value Left Side of Charts, Work on Context in Chart, Analysis vs Strategy vs Method.",
      "source_videos": ["M70f76duW2s", "QNRJX4b7Qq4", "Tiy6bO9hXJ4"],
      "root": {
        "id": "t4_1",
        "question": "Have you analyzed the left side of the chart for context?",
        "yes": {
          "id": "t4_2",
          "question": "Is there an activated failure (price reached a zone but origin didn't meet 25% minimum)?",
          "quote_es": "¿Esto es un origen de movimiento correcto? No. ¿Por qué no? Porque no ha llegado al 25%.",
          "yes": {
            "id": "t4_3",
            "action": "FAILURE PROJECTION ACTIVE — Price has projection to reach 161.8 or 200 level",
            "explanation": "When a movement origin doesn't reach 25% (defective extreme), the price is likely to return and surpass that level. This activates a failure projection to 161.8 or 200. Even if you're in a selling zone, you cannot ignore the long projection. 'Tengo una proyección para ir arriba. Tengo una proyección para ir al 200 o al 161.8.'",
            "then": {
              "id": "t4_3a",
              "question": "Are you trading indices/commodities or currencies?",
              "yes_label": "Indices/Commodities",
              "no_label": "Currencies",
              "yes": {
                "id": "t4_3b",
                "action": "Favor the 200 level as target — 161.8 fails more often in indices",
                "explanation": "In indices and commodities, the 161.8 level often doesn't hold. The 200 level works much better. 'El 161 trabaja mucho mejor en divisas, en índices y materias primas falla bastante. Los 200 están trabajando mejor.'"
              },
              "no": {
                "id": "t4_3c",
                "action": "161.8 is a valid first target — 200 as secondary",
                "explanation": "In currencies, the 161.8 level tends to produce better reactions. Use it as the primary target, with 200 as the extended target."
              }
            }
          },
          "no": {
            "id": "t4_4",
            "question": "Do you have Pattern 1 and Pattern 2 measurements?",
            "yes": {
              "id": "t4_5",
              "question": "Has price completed Pattern 2 and reached the selling/buying zone?",
              "yes": {
                "id": "t4_6",
                "question": "Is the 161.8 level inside or outside the zone?",
                "yes_label": "161 is OUTSIDE the zone",
                "no_label": "161 is INSIDE the zone",
                "yes": {
                  "id": "t4_7",
                  "action": "CALM OPTION first — expect measured move to 161.8, then possibly 200",
                  "explanation": "When 161 stays outside the zone, the first option is always the calm reaction. 'Siempre que el 161 se quede fuera, primero siempre tenemos la opción de calmada.' Most probable is price reaches at least 161.8 and likely 200.",
                  "quote_es": "Lo más probable es que alcances como mínimo el 161 y seguramente al 200."
                },
                "no": {
                  "id": "t4_8",
                  "action": "Zone and 161 overlap — increased probability of immediate reaction",
                  "explanation": "When 161.8 is within the zone, the reaction point is reinforced. Higher probability of a reversal at this level."
                }
              },
              "no": {
                "id": "t4_9",
                "action": "WAIT — Patterns measured but price hasn't reached the zone yet",
                "explanation": "The reading model has given you the probable destination. Prepare your hypotheses: 'Either price reaches the zone (prepare to trade) or it touches the invalidation level (hypothesis changes).' The succession of hypotheses is always the same, always repetitive."
              }
            },
            "no": {
              "id": "t4_10",
              "action": "Measure Pattern 1 and Pattern 2 — these are objective, no interpretation needed",
              "explanation": "Patterns 1 and 2 are objective measurements to evaluate market zones. They form the basis for hypotheses about future price movements. The measurements are always the same, always repetitive. 'Las medidas son 100% objetivas, no hay duda de lo que tengo que medir.'"
            }
          }
        },
        "no": {
          "id": "t4_11",
          "action": "ALWAYS analyze the left side first — context before action",
          "explanation": "Never trade without context. Check: (1) What failures are activated? (2) What liquidity has been left behind? (3) Where are the historical Points of Control? (4) What is the movement origin — is it correct (reached 25%) or defective? The context tells you which direction has projection even if the immediate map says otherwise. 'Nos falta contexto. No porque esté en zona de venta asumimos que es para vender. No funciona así.'"
        }
      }
    },

    {
      "tree_name": "T5_Liquidity_And_Entry_Strategy",
      "tree_description": "The attack model: how to actually enter trades using liquidity grabs, zone confluences, and Fibonacci levels. The reading model tells you WHERE; this tells you HOW. Enhanced in v3.0 with minimum stop rules, deep entry pattern, and immediate exit on pattern invalidation. Source: Analysis vs Strategy vs Method, Value Left Side of Charts, Evolution of Cycles, Gold Trading with the Kids, Minimum Stop Sizes.",
      "source_videos": ["Tiy6bO9hXJ4", "M70f76duW2s", "ExKdYnCebqY", "aUHXlpn-iRc", "ncC4_enuX-8"],
      "root": {
        "id": "t5_1",
        "question": "Has the reading model (cycles) given you a directional bias?",
        "quote_es": "Los ciclos te posicionan. No necesito ni las zonas de trabajo para atacar el precio.",
        "yes": {
          "id": "t5_2",
          "question": "Is price at a zone confluence (e.g., Low Zone + 38 of another cycle)?",
          "yes": {
            "id": "t5_3",
            "action": "HIGH CONVICTION ENTRY — This is a 'sí o sí' (mandatory) trade",
            "explanation": "When zones from different cycles or levels converge, the probability is highest. Example from Evolution of Cycles: Low zone coinciding with blue 38 = mandatory buy. 'Esta coincidencia de la zona baja con el 38 azul es ya un motivo sí o sí de compra.'",
            "quote_es": "Esto es compra. Sí o sí.",
            "then": {
              "id": "t5_3a",
              "question": "Are you entering with single entry or fractional entry?",
              "yes_label": "Single Entry",
              "no_label": "Fractional Entry (2 parts recommended, 3+ gets confusing)",
              "yes": {
                "id": "t5_3b",
                "action": "Enter full position. Stop defined by business plan line. Lot size per business plan.",
                "explanation": "Single entry with full position. Stop loss is defined by your business plan's risk line, not by arbitrary levels. Lot size is calculated from your risk parameters.",
                "then": {
                  "id": "t5_3b_stop",
                  "question": "Is your stop loss at least the minimum required for this asset?",
                  "note": "Forex minimum: 12 pips. Gold: asset-specific minimum. Indices: asset-specific minimum.",
                  "quote_es": "Nunca uses un stop loss inferior a 12 pips en Forex.",
                  "yes": {
                    "id": "t5_3b_ok",
                    "action": "PROCEED with entry — stop meets minimum requirements"
                  },
                  "no": {
                    "id": "t5_3b_fix",
                    "action": "INCREASE STOP to minimum — Never use stop loss < 12 pips in Forex. Reduce lot size to compensate.",
                    "explanation": "Small stops cause over-leveraging and prevent proper protection management. If the pattern suggests 6 pips, still use 12 minimum. 'Nunca uses un stop loss inferior a 12 pips en Forex.' Adjust lot size downward to maintain the same dollar risk."
                  }
                }
              },
              "no": {
                "id": "t5_3c",
                "action": "Enter first part at zone. Second part at deeper level if available. Max 2 parts recommended.",
                "explanation": "Fractional entry works best with 2 parts. From 3 parts it becomes confusing. 'La gente que mejor trabaja con entrada fraccionada lo hace con dos. A partir de tres se hace confusa.'"
              }
            }
          },
          "no": {
            "id": "t5_4",
            "question": "Are there liquidity grab opportunities aligned with your directional bias?",
            "quote_es": "Solo con esto puedes tener una metodología, una estrategia, una estrategia de trabajo. Solo con esto.",
            "yes": {
              "id": "t5_5",
              "question": "Has price broken lows (if bias is long) or broken highs (if bias is short)?",
              "yes": {
                "id": "t5_6",
                "action": "ENTER on the liquidity grab — price has taken stops and should reverse",
                "explanation": "Liquidity grabs that break low points (in uptrend bias) or high points (in downtrend bias) are standalone entry reasons. 'Sitios de liquidez, en este caso, que rompan puntos bajos, porque mi modelo me dice que el precio tiene que subir más.' No cycles needed for the entry itself — the cycles already positioned you.",
                "quote_es": "No hace falta ningún puto ciclo porque los ciclos ya te han posicionado."
              },
              "no": {
                "id": "t5_7",
                "action": "WAIT for price to grab liquidity or reach a zone",
                "explanation": "The bias is set but no clean entry exists yet. Wait for price to sweep stops or reach a defined zone before entering."
              }
            },
            "no": {
              "id": "t5_8",
              "question": "Is price at a Fibonacci level (38.2, 61.8, 161.8, or 200) that aligns with your bias?",
              "yes": {
                "id": "t5_9",
                "question": "Is it a 61.8 level from a valid structure with confirmed failure of highs/lows?",
                "yes": {
                  "id": "t5_10",
                  "action": "ENTER — Any 61.8 after failure of highs/lows is a reason to trade",
                  "explanation": "Once there's been a failure of highs (for shorts) or lows (for longs), every 61.8 retracement becomes a valid entry point. 'A partir de aquí ya cualquier 61.8, esto ya era motivo de venta.'",
                  "quote_es": "A partir de aquí ya cualquier 61.8, esto ya era motivo de venta."
                },
                "no": {
                  "id": "t5_11",
                  "action": "EVALUATE — Fibonacci level alone may be sufficient depending on context",
                  "explanation": "A standalone Fibonacci level aligned with bias can be traded, but conviction is lower than zone confluences or post-failure entries. Consider the left side context.",
                  "then": {
                    "id": "t5_11a",
                    "question": "Does the setup suggest a 'deep entry' pattern (anticipating pullback with larger stop)?",
                    "yes": {
                      "id": "t5_11b",
                      "action": "DEEP ENTRY — Place larger stop and reduce lot size accordingly",
                      "explanation": "A deep entry pattern anticipates a deeper pullback. Use a larger-than-typical stop but with reduced lot size to keep dollar risk the same. This gives the trade room to breathe."
                    },
                    "no": {
                      "id": "t5_11c",
                      "action": "Standard entry with minimum stop requirements met"
                    }
                  }
                }
              },
              "no": {
                "id": "t5_12",
                "action": "WAIT — No valid entry signal. Let the reading model guide you to the next opportunity.",
                "explanation": "Don't force entries. The model will present opportunities. 'No puedo tener una estrategia para atacar el precio si no tengo una localización en el mapa.'"
              }
            }
          }
        },
        "no": {
          "id": "t5_13",
          "action": "STOP — Do NOT trade without directional bias from the reading model",
          "explanation": "You must have a reading model (cycles) that positions you before applying any entry strategy. Strategy without a map is gambling. 'Lo que nunca debería tener es una estrategia para atacar el precio si no tengo una localización en el mapa. Tengo que tener un modelo de lectura y un modelo de ataque.'"
        }
      },
      "critical_rules_v3": [
        {
          "rule": "Never use stop loss < 12 pips in Forex",
          "source": "ncC4_enuX-8",
          "quote_es": "Nunca uses un stop loss inferior a 12 pips en Forex."
        },
        {
          "rule": "Exit IMMEDIATELY if the entry pattern is invalidated by price action",
          "source": "ncC4_enuX-8",
          "quote_es": "Sal de la operación inmediatamente si el precio invalida el patrón de entrada."
        },
        {
          "rule": "Deep entry pattern: anticipate pullback, use larger stop with reduced lot size",
          "source": "ncC4_enuX-8"
        },
        {
          "rule": "Asset-specific stop minimums exist — gold, indices, and currencies each have different requirements",
          "source": "ncC4_enuX-8"
        }
      ]
    },

    {
      "tree_name": "T6_Trade_Classification",
      "tree_description": "How to classify trade outcomes. There are 5 types: Complete Loser, Null Trade, Positive Trade, Winning Trade, Very Winning Trade. Understanding this is essential for business plan tracking. Source: Many Ways to Win and Lose.",
      "source_videos": ["6U91ZG1e80g"],
      "root": {
        "id": "t6_1",
        "question": "Did the trade hit the full stop loss (max loss per business plan)?",
        "yes": {
          "id": "t6_2",
          "action": "COMPLETE LOSER (Operación completamente perdedora)",
          "explanation": "Price went straight to stop without any opportunity for management. Loss equals the maximum defined in the business plan. Example: If business plan says max loss is $50, the trade lost $50. 'Entro al mercado, pongo el stop, y no me da tiempo a hacer nada, el precio va directo al stop.'"
        },
        "no": {
          "id": "t6_3",
          "question": "Did you exit early because price moved against you quickly with no reversal intent?",
          "quote_es": "Yo no permito que me saque el stop completo.",
          "yes": {
            "id": "t6_4",
            "action": "NULL TRADE (Operación nula)",
            "explanation": "You cut the loss early. Instead of losing the full $50, you lost $25 (example). The loss is less than the business plan maximum. This is active risk management — refusing to let price take the full stop when it clearly has no intention of reversing. 'Una operación nula, si el precio rápidamente se mueve en mi contra y veo que no tiene intención de moverse a mi favor, generalmente no mantengo esas operaciones.'"
          },
          "no": {
            "id": "t6_5",
            "question": "Did the trade reach at least one partial profit level?",
            "yes": {
              "id": "t6_6",
              "question": "Did the total of all partials reach the business plan profit target?",
              "yes": {
                "id": "t6_7",
                "question": "Did the trade exceed the business plan target significantly (left runners to extended levels)?",
                "yes": {
                  "id": "t6_8",
                  "action": "VERY WINNING TRADE (Operación muy ganadora)",
                  "explanation": "The trade surpassed the planned target. Example: Plan was $300, trade made $500+. These are the trades that significantly boost the account. They happen maybe 10-20 times per year for a sharp trader. 'Esto es una operación muy ganadora. Son las operaciones típicas que de repente tu cuenta sube mucho.'",
                  "quote_es": "Por tanto, esto es una operación muy ganadora."
                },
                "no": {
                  "id": "t6_9",
                  "action": "WINNING TRADE (Operación ganadora)",
                  "explanation": "The trade met the business plan objective through partials and/or final exit. Total profit equals the target. Example: Target was $300, sum of partials + final = $300. 'He sumado 300 euros. Para considerar una operación ganadora, con parciales o sin parciales, tengo que hacer 300.'"
                }
              },
              "no": {
                "id": "t6_10",
                "action": "POSITIVE TRADE (Operación positiva — NOT a winner)",
                "explanation": "The trade reached a partial but then reversed to breakeven or small profit. Made some money (e.g., $40) but far less than the target ($300). These trades will NEVER grow your account. They exist only to offset losses from complete losers and null trades. 'Una operación positiva no hará nunca crecer tu cuenta, sirven para recuperar una operación completamente perdedora o nula.'",
                "quote_es": "Estas operaciones positivas nunca van a hacer crecer tu cuenta."
              }
            },
            "no": {
              "id": "t6_11",
              "action": "BREAKEVEN or small loss — classify as NULL or near-null based on P&L",
              "explanation": "The trade didn't reach even the first partial. If stopped at breakeven (after moving stop), it's effectively null. If stopped at partial stop (half), it's a reduced loss."
            }
          }
        }
      }
    },

    {
      "tree_name": "T7_Post_Entry_Management",
      "tree_description": "How to manage a trade after entry: stop adjustments, partials, and trailing. Enhanced in v3.0 with position addition rules, divided position work, and distribution of operations. Source: Students Preferred Ratios, Good/Bad Use of Partials, Super Winning Trades, Trading Gold & Silver, Only Add When Price Confirms, Account Size is Ridiculous.",
      "source_videos": ["fk3luzBRmHA", "ijMX71M37Uw", "koKCbtrB_eI", "aUHXlpn-iRc", "g44ncKXTQYY", "Fr4lEDnT2SM"],
      "root": {
        "id": "t7_1",
        "question": "Are you using a fixed ratio approach or a super-winner approach?",
        "yes_label": "Fixed Ratio (easier psychologically, recommended to master FIRST)",
        "no_label": "Super-Winner approach (for experienced traders)",
        "yes": {
          "id": "t7_2",
          "question": "What is your ratio setup?",
          "note": "Most common comfortable ratio is 1:4. This works for both single and fractional entries.",
          "sub_tree": {
            "id": "t7_2a",
            "question": "Has price reached 1:1 risk-reward?",
            "yes": {
              "id": "t7_2b",
              "question": "Are you using Version A (no partials) or Version B (with partials)?",
              "yes_label": "Version A: No partials",
              "no_label": "Version B: With partials",
              "yes": {
                "id": "t7_2c",
                "action": "Move stop to HALF the original distance. No partial taken. Target remains at 1:4.",
                "explanation": "At 1:1, move the stop to half. If the trade fails from here, you lose only half the original risk. The trade continues to the 1:4 target. 'Cuando el precio está en el 1 a 1, colocan el stop a la mitad. Se acabó la gestión.'",
                "quote_es": "Se acabó la gestión."
              },
              "no": {
                "id": "t7_2d",
                "action": "Take PARTIAL (half position) and move stop to HALF. Remaining position targets extended level.",
                "explanation": "At 1:1 take half off. Move stop to half for the remaining. If partial was at 1:1, final target is 1:7. If partial was at 1:2, final target is 1:6. 'Al 1 a 1 sacan parcial, stop a la mitad.'",
                "then": {
                  "id": "t7_2e",
                  "question": "Was the partial at 1:1 or 1:2?",
                  "yes_label": "Partial at 1:1",
                  "no_label": "Partial at 1:2",
                  "yes": {
                    "id": "t7_2f",
                    "action": "Remaining position targets 1:7"
                  },
                  "no": {
                    "id": "t7_2g",
                    "action": "Remaining position targets 1:6"
                  }
                }
              }
            },
            "no": {
              "id": "t7_2h",
              "question": "Has price reached 1:2?",
              "yes": {
                "id": "t7_2i",
                "action": "Alternative: Move stop to half at 1:2 instead of 1:1"
              },
              "no": {
                "id": "t7_2j",
                "action": "HOLD — No management action yet. Monitor trade."
              }
            }
          }
        },
        "no": {
          "id": "t7_3",
          "question": "Have you ALREADY decided at entry where you will let the trade run to?",
          "quote_es": "El secreto, al menos el que me funciona a mí: decidir dónde vas a salir cuando entras.",
          "yes": {
            "id": "t7_4",
            "question": "Has the first protective partial been taken?",
            "yes": {
              "id": "t7_5",
              "question": "Is the trade already profitable overall (accounting for partials taken)?",
              "yes": {
                "id": "t7_6",
                "action": "LET IT RUN to predetermined exit — Do NOT be intimidated by price movements",
                "explanation": "The trade is profitable. The remaining positions run to the failure level or predetermined target. You will see erratic price movements — this is normal. Do not close early because of fear.",
                "quote_es": "Si no decidimos esto en ese momento, de forma objetiva y clara, cuando te encuentres movimientos erráticos del precio, no puedes achicarte.",
                "sub_decisions": {
                  "id": "t7_6a",
                  "question": "Has floating profit exceeded 10% of total account balance?",
                  "yes": {
                    "id": "t7_6b",
                    "action": "SECURE PROFITS — Take some positions off to lock in gains",
                    "explanation": "When floating exceeds 10% of balance, you need to secure some profit. This is a risk management rule. 'Llevamos más de un 10% siempre os digo en flotante que tenemos que coger beneficios.'",
                    "quote_es": "Llevamos más de un 10% siempre os digo en flotante que tenemos que coger beneficios."
                  },
                  "no": {
                    "id": "t7_6c",
                    "action": "Continue holding — keep adding if new entry signals appear in the same direction",
                    "explanation": "As the movement continues, keep incorporating new positions at valid entry points. This compounds the trade. 'Vas incorporando al movimiento. Si van bien, sigues sumando, sumando, sumando.'"
                  }
                }
              },
              "no": {
                "id": "t7_7",
                "action": "First partial MUST protect the rest — this is non-negotiable",
                "explanation": "The first partial's purpose is to secure the remaining positions. It ensures the trade won't cost money even if the rest fails. 'Lo primero que hago cuando pongo 2 o 3 operaciones aquí es decidir dónde tomo parciales. Dónde doy por sentado que esta operación no me va a costar dinero.'",
                "quote_es": "Esa es una mano, por eso es el primer parcial que asegura el resto."
              }
            },
            "no": {
              "id": "t7_8",
              "action": "Take the PROTECTIVE PARTIAL first — at the nearest Fibonacci level or key zone",
              "explanation": "Before thinking about super-winners, secure the trade. Take the first partial at the nearest significant level (e.g., 61 zone, key resistance). This partial protects all remaining positions."
            }
          },
          "no": {
            "id": "t7_9",
            "action": "DECIDE NOW — You must know your final target BEFORE or immediately after entering",
            "explanation": "You cannot manage a super-winner trade without a predetermined exit. If you don't decide beforehand, doubt will overwhelm you during erratic movements.",
            "quote_es": "Es mucho más fácil gestionarlo mentalmente si lo decido antes."
          }
        }
      },
      "critical_rules_v3": [
        {
          "rule": "NEVER add positions when a previous position is going against you",
          "source": "g44ncKXTQYY",
          "quote_es": "Nunca añadas posiciones cuando una posición anterior va en tu contra."
        },
        {
          "rule": "Work with divided positions — structure entries in 2, 3, or 4 shots and add as price confirms",
          "source": "g44ncKXTQYY",
          "quote_es": "Siempre intenta trabajar con posiciones divididas, es decir, si queremos meter una posición, estructurarla en dos, tres, cuatro entradas."
        },
        {
          "rule": "Distribution of operations: decide BEFORE entry how many trades in each zone, inside vs outside",
          "source": "Fr4lEDnT2SM",
          "quote_es": "Yo ya sé cuántas operaciones voy a hacer dentro de cada una de ellas antes de entrar."
        },
        {
          "rule": "Be a sniper, not a scattergun — limited account = limited bullets = extreme selectivity",
          "source": "Fr4lEDnT2SM",
          "quote_es": "Tienes que ser un puto francotirador porque no te queda otra. No tienes ametralladora."
        },
        {
          "rule": "Choose inside or outside execution and commit — do not try both with limited resources",
          "source": "Fr4lEDnT2SM",
          "quote_es": "Operas o dentro o fuera, no las dos cosas, y te casas con una."
        }
      ]
    },

    {
      "tree_name": "T8_Partial_Profit_Strategy",
      "tree_description": "Detailed rules on when and how to take partial profits. Too many partials destroy statistics; too few create psychological pressure. Source: Good/Bad Use of Partials, Evolution of Cycles, Trading Gold & Silver.",
      "source_videos": ["ijMX71M37Uw", "ExKdYnCebqY", "aUHXlpn-iRc"],
      "root": {
        "id": "t8_1",
        "question": "What is your partial-taking style?",
        "note": "There is no single best approach. This is deeply personal. 'La cuestión de parciales, cada uno la interpreta a su manera.'",
        "sub_tree": {
          "id": "t8_1a",
          "question": "Are you a conservative trader (many partials) or aggressive trader (few partials)?",
          "yes_label": "Conservative — Multiple partials along the way",
          "no_label": "Aggressive — Single partial, let rest run",
          "yes": {
            "id": "t8_2",
            "action": "Take partials at each significant Fibonacci level as price reaches them",
            "explanation": "This is psychologically easier but WARNING: too many partials dilute the final result. When price makes a 700-pip move but you've been releasing positions at every level, the total money is far less than 700 pips would suggest.",
            "then": {
              "id": "t8_2a",
              "action": "EVALUATE YOUR STATISTICS — Do the numbers actually work with this many partials?",
              "explanation": "You must check: does the sum of many small partials compensate for the losing streaks? If not, you're surviving on partials but never growing the account. 'Detrás de todo lo que haces hay números.'"
            }
          },
          "no": {
            "id": "t8_3",
            "action": "Take ONE partial at the first key level (e.g., 61 zone), then let the rest run to final target",
            "explanation": "This is Joaquín's personal approach for large-target trades. One partial to secure the trade, everything else rides. The result: long losing/breakeven streaks, but when winners hit, they compensate massively.",
            "then": {
              "id": "t8_3a",
              "question": "Is the partial at a level that coincides with a zone or key Fibonacci?",
              "yes": {
                "id": "t8_3b",
                "action": "TAKE THE PARTIAL — this is a mandatory partial level (motivo de parcial sí o sí)",
                "explanation": "When key levels coincide — for example, cycle 61 zone + the resistance level — this is an obligatory partial. 'Esto es motivo de parcial, sí o sí.'",
                "quote_es": "Esto es motivo de parcial, sí o sí."
              },
              "no": {
                "id": "t8_3c",
                "action": "HOLD — Wait for a proper level to take the partial",
                "explanation": "Don't take partials at random levels. Wait for a meaningful Fibonacci or zone coincidence."
              }
            }
          }
        }
      }
    },

    {
      "tree_name": "T9_161_200_Zone_Trading",
      "tree_description": "Specific decision tree for trading the 161.8% to 200% Fibonacci zone, which behaves differently across asset classes and requires special handling. Source: Better Explained Live, Work on Context in Chart, Value Left Side of Charts, Gold Trading with the Kids.",
      "source_videos": ["p9aw5DkgFX8", "QNRJX4b7Qq4", "M70f76duW2s", "aUHXlpn-iRc"],
      "root": {
        "id": "t9_1",
        "question": "Has price reached the 161.8% Fibonacci extension?",
        "yes": {
          "id": "t9_2",
          "question": "Does price react (reverse) at 161.8?",
          "yes": {
            "id": "t9_3",
            "action": "FIRST ATTEMPT — Trade the reversal, but be prepared for failure",
            "explanation": "The first reaction at 161.8 is a valid trade. But if it fails (price returns to 161.8), the behavior pattern shifts to failure-based progression toward 200.",
            "quote_es": "Si en este primer intento el precio no quiere tirar..."
          },
          "no": {
            "id": "t9_4",
            "question": "Is the distance between 161.8 and 200 large (high timeframe pattern)?",
            "yes": {
              "id": "t9_5",
              "action": "EXPECT FAILURE-BASED PROGRESSION to 200 — Price will make repeated attempts",
              "explanation": "When the distance is large, price typically doesn't shoot straight to 200. Instead, it makes repeated failures: hits 161.8, fails, retraces, hits a new 161.8, fails again, progressively working toward 200. This is especially true in indices and commodities.",
              "quote_es": "Si este primer nivel no se comporta bien, lo más probable es que el precio, para alcanzar ese nivel, lo haga a base de fracasos.",
              "then": {
                "id": "t9_5a",
                "question": "Can you work the small moves within the failures?",
                "yes": {
                  "id": "t9_5b",
                  "action": "Trade the internal cycles within the 161-200 zone using Points of Control"
                },
                "no": {
                  "id": "t9_5c",
                  "action": "WAIT for price to reach 200 — enter there with buffer for spike",
                  "explanation": "If the internal movements don't offer clean entries, wait for the 200 level. Add a buffer zone for potential spikes."
                }
              }
            },
            "no": {
              "id": "t9_6",
              "action": "Price may go directly to 200 — smaller patterns move faster",
              "explanation": "On smaller timeframes or patterns, the 161.8-200 distance is small enough that price can cover it in one move."
            }
          }
        },
        "no": {
          "id": "t9_7",
          "action": "WAIT — Monitor for approach to 161.8 extension level"
        }
      }
    },

    {
      "tree_name": "T10_Risk_And_Business_Plan",
      "tree_description": "Risk management framework: max loss, setbacks, adaptation, and the five factors of profitability. Enhanced in v3.0 with drawdown thresholds, segment trading, and account size awareness. Source: Must Keep This In Mind, Setbacks - Enemy of Novice Traders, Many Ways to Win and Lose, Drawdown Debate, Account Size is Ridiculous.",
      "source_videos": ["u6K3H8d-4J0", "GrH-mtabADo", "6U91ZG1e80g", "1YCSx7gXPF0", "Fr4lEDnT2SM"],
      "root": {
        "id": "t10_1",
        "question": "Do you have a complete business plan with defined max loss, profit targets, and lot sizing?",
        "yes": {
          "id": "t10_2",
          "question": "Are ALL FIVE profitability factors aligned?",
          "note": "The five factors are: (1) Discipline, (2) Numbers (risk/reward), (3) Method, (4) Assets, (5) Personal Condition",
          "quote_es": "Si uno falla, no serás exitoso. Has conseguido crear una mezcla correcta de estos cinco factores.",
          "yes": {
            "id": "t10_3",
            "question": "Is your current drawdown within acceptable limits?",
            "then": {
              "id": "t10_3_dd",
              "question": "Is drawdown less than 15% from initial capital?",
              "yes": {
                "id": "t10_3a",
                "question": "Are the assets you trade still behaving as expected for your method?",
                "yes": {
                  "id": "t10_4",
                  "question": "Has your personal condition changed (availability, emotional state, life circumstances)?",
                  "yes": {
                    "id": "t10_5",
                    "action": "ADAPT — Your method may need adjustment for your new personal condition",
                    "explanation": "Personal changes affect trading. If your availability changed, your timeframes may need to change. 'Tu condición personal no es la misma.'",
                    "quote_es": "Te empiezas a dar cuenta de que tu condición personal no es la misma."
                  },
                  "no": {
                    "id": "t10_6",
                    "action": "CONTINUE — All factors aligned. Execute the plan."
                  }
                },
                "no": {
                  "id": "t10_7",
                  "action": "ADAPT ASSETS — Find assets that match your method's current requirements",
                  "explanation": "Assets change behavior over time. What worked for 2-3 years may stop working.",
                  "quote_es": "¿Qué pasa cuando te das cuenta de que los activos con los que trabajas no se comportan igual?"
                }
              },
              "no": {
                "id": "t10_3b",
                "action": "DRAWDOWN ALERT — See T17 (Drawdown Management) for specific protocols",
                "explanation": "You have exceeded 15% drawdown from initial capital. This triggers specific management protocols. Refer to T17 for detailed guidance.",
                "next_tree": "T17_Drawdown_Management"
              }
            }
          },
          "no": {
            "id": "t10_8",
            "action": "IDENTIFY the weak factor and fix it before trading",
            "explanation": "If any of the five factors is missing, you cannot be profitable. Discipline and numbers tend to be stable. The volatile factors are assets and personal condition."
          }
        },
        "no": {
          "id": "t10_9",
          "action": "STOP TRADING — Build a complete business plan first",
          "explanation": "Without a business plan you have no max loss, no profit targets, no lot sizing rules. You are gambling."
        }
      },
      "critical_rules_v3": [
        {
          "rule": "Never allow drawdown to exceed 15% from initial capital without intervention",
          "source": "1YCSx7gXPF0",
          "quote_es": "Nunca permitas que el drawdown exceda el 15% de tu capital inicial."
        },
        {
          "rule": "With small accounts (10k-50k), you are extremely limited — be a sniper",
          "source": "Fr4lEDnT2SM",
          "quote_es": "¿Dónde vas tú con tres operaciones al día? ¿Y dónde vas con 38 pips por stop? ¿Eres consciente?"
        },
        {
          "rule": "Segment your trading: change aggressiveness based on account performance segments",
          "source": "1YCSx7gXPF0"
        }
      ]
    },

    {
      "tree_name": "T11_Method_Architecture",
      "tree_description": "The three-layer architecture of the complete method: Reading Model + Attack Model + Management = Complete Method. Source: Analysis vs Strategy vs Method.",
      "source_videos": ["Tiy6bO9hXJ4"],
      "root": {
        "id": "t11_1",
        "question": "Do you understand the difference between Reading Model, Attack Model, and Management?",
        "yes": {
          "id": "t11_2",
          "question": "Do you have a Reading Model (how you interpret the chart)?",
          "yes": {
            "id": "t11_3",
            "question": "Do you have an Attack Model (how you execute entries based on the reading)?",
            "yes": {
              "id": "t11_4",
              "question": "Do you have Management rules (risk, stops, partials, exits)?",
              "yes": {
                "id": "t11_5",
                "action": "COMPLETE METHOD — You have all three layers. Execute.",
                "explanation": "Reading Model (cycles/fractality) + Attack Model (entries via zones, liquidity grabs, patterns) + Management (business plan, stops, partials) = Complete Method. 'Modelo de lectura, modelo de ataque, y todo eso delineado con gestión. Punto.'"
              },
              "no": {
                "id": "t11_6",
                "action": "BUILD MANAGEMENT RULES — Define your personal risk, entry, exit, and post-entry rules"
              }
            },
            "no": {
              "id": "t11_7",
              "action": "DEVELOP ATTACK MODEL — Choose your entry method (zones, liquidity grabs, patterns, or combination)"
            }
          },
          "no": {
            "id": "t11_8",
            "action": "LEARN THE READING MODEL FIRST — Cycles, fractality, zones, points of control"
          }
        },
        "no": {
          "id": "t11_9",
          "action": "CRITICAL DISTINCTION — Learn what each layer is BEFORE trying to trade",
          "explanation": "People confuse these constantly. The YouTube course = Reading Model ONLY. It is NOT a strategy.",
          "quote_es": "Cuando hablas con alguien de estrategia, cada uno tiene un concepto diferente. Esto es un lío gordo. Modelo de lectura, modelo de ataque, y todo eso delineado con gestión. Punto."
        }
      }
    },

    {
      "tree_name": "T12_Super_Winner_Psychology",
      "tree_description": "The psychological framework for holding trades to super-winner status. Enhanced in v3.0 with 5-phase mastery concept and the understanding that methods are just triggers. Source: Super Winning Trades, Good/Bad Use of Partials, Methods Are Not What You Think, Results Curve.",
      "source_videos": ["koKCbtrB_eI", "ijMX71M37Uw", "G_22Hli7Hls", "aY_rYYg3GZ0"],
      "root": {
        "id": "t12_1",
        "question": "Have you mastered the fixed-ratio management style first?",
        "quote_es": "Cuando tengas dominada esa gestión de ratio fijo, entonces expandir tu mente y tu capacidad de estirar.",
        "yes": {
          "id": "t12_2",
          "question": "Do you understand that methods/analysis are just TRIGGERS, not the core method?",
          "note": "V3.0 addition: Traditional entry analysis is merely a trigger. The real method is what happens post-entry.",
          "quote_es": "Los métodos de trading no son lo que te han contado. Son solo disparadores.",
          "yes": {
            "id": "t12_2a",
            "question": "Are you willing to accept that MOST attempts at super-winners will fail?",
            "yes": {
              "id": "t12_3",
              "question": "Is the trade already secured (protective partial taken, remaining positions in profit)?",
              "yes": {
                "id": "t12_4",
                "question": "Did you decide the final exit target BEFORE or immediately after entry?",
                "yes": {
                  "id": "t12_5",
                  "action": "HOLD through erratic movements — The decision is made. Do not back down.",
                  "explanation": "The price will make many erratic movements before reaching your target. You already made the decision. Maybe 10-20 per year actually hit the target. 'Cuando te encuentres estos movimientos erráticos del precio, no puedes achicarte.'",
                  "quote_es": "Si no lo intentas, nunca lo tienes.",
                  "sub_decisions": {
                    "id": "t12_5a",
                    "question": "Is your predetermined target the 'failure' of a significant cycle?",
                    "yes": {
                      "id": "t12_5b",
                      "action": "Hold until failure target is hit OR price takes you out"
                    },
                    "no": {
                      "id": "t12_5c",
                      "action": "Hold until predetermined Fibonacci extension or zone target"
                    }
                  }
                },
                "no": {
                  "id": "t12_6",
                  "action": "DECIDE NOW — Without a predetermined exit, doubt will overwhelm you"
                }
              },
              "no": {
                "id": "t12_7",
                "action": "SECURE THE TRADE FIRST — Take protective partial before thinking about super-winners"
              }
            },
            "no": {
              "id": "t12_8",
              "action": "STICK WITH FIXED RATIO — Super-winners are NOT for everyone",
              "explanation": "If you use fixed ratios, you will NEVER have a super-winning trade. That's okay. It's psychologically easier."
            }
          },
          "no": {
            "id": "t12_2b",
            "action": "UNDERSTAND THE 5-PHASE MASTERY CONCEPT first",
            "explanation": "Phase 1: Master risk management (lot sizes, stops, painless losing). Phase 2: Master profit management (targets without exceeding pain threshold). Phase 3: Define post-entry strategy (what you do after entering). Phase 4: Build discipline through repetition. Phase 5: Methods become mere triggers — the real method is your complete post-entry system. 'No pases a la siguiente lección sin dominar la fase actual.'",
            "quote_es": "No pases a la siguiente lección sin dominar la fase actual."
          }
        },
        "no": {
          "id": "t12_9",
          "action": "MASTER FIXED RATIO FIRST — Do not attempt super-winners before mastering basics",
          "explanation": "The progression is: (1) Master fixed ratio management, (2) Then expand your mind to stretch targets."
        }
      },
      "critical_rules_v3": [
        {
          "rule": "Methods are just triggers — the real method is your post-entry system",
          "source": "G_22Hli7Hls",
          "quote_es": "Un método de trading no es lo que te han contado."
        },
        {
          "rule": "5-phase mastery: risk management → profit management → post-entry strategy → discipline → triggers",
          "source": "G_22Hli7Hls"
        },
        {
          "rule": "Adapt your results curve — when curve is favorable, trade differently than when it's against you",
          "source": "aY_rYYg3GZ0",
          "quote_es": "Si tu curva de resultados cae mucho, es por tu culpa."
        }
      ]
    },

    {
      "tree_name": "T13_Chart_Analysis_Methodology",
      "tree_description": "The three ways to study charts and how to use each for improvement. Source: Fractality Practice Example.",
      "source_videos": ["4b2ZAImaATk"],
      "root": {
        "id": "t13_1",
        "question": "What type of chart analysis are you doing?",
        "options": {
          "past_complete": {
            "id": "t13_2",
            "action": "PAST, COMPLETED, GLOBAL CHART — See the entire movement to understand the big picture",
            "explanation": "This is the first way. You see a complete chart and identify what price did globally. Useful for understanding the overall fractal structure."
          },
          "past_reviewed": {
            "id": "t13_3",
            "action": "PAST, REVIEWED CHART — Go through the nuances of how the movement was constructed (MOST IMPORTANT)",
            "explanation": "This is Joaquín's recommended method. Take a completed movement and review it bar by bar, understanding internal fractality. 'Para mí, sin duda, el más importante es el gráfico pasado, revisado.'",
            "quote_es": "Este ejercicio lo he hecho miles de veces para verificar cosas."
          },
          "moving_chart": {
            "id": "t13_4",
            "action": "MOVING CHART — Live, day-to-day evolution of price where you apply the method",
            "explanation": "This is real-time trading. The live chart where fractals form in real time. The quality of your live reading depends on how much past reviewed chart work you've done."
          }
        }
      }
    },

    {
      "tree_name": "T14_Hedging_And_Coberturas",
      "tree_description": "When and how to hedge: constant hedging strategy, CFD selection, position management with divided positions, zone indifference principle. Hedging allows profit regardless of direction by holding opposing positions simultaneously. Source: Hedging Simplifies Management, Coberturas Essential, Constant Hedging, CFDs for Hedging, SP500 Hedging Example, Hedging Yields Good Results, All Positions Stopped But Win.",
      "source_videos": ["UagTOjoC4us", "LtSfnLbTPMI", "-1ynDl64noU", "I9ZbsIRYxAg", "bzJTdS2tw5M", "UKv_l1zUPr8", "jdb0RQrQcbE", "zcP866VYuI8"],
      "root": {
        "id": "t14_1",
        "question": "Are you trading with multiple positions (at least 2)?",
        "yes": {
          "id": "t14_2",
          "question": "Do you have a directional bias from your reading model?",
          "yes": {
            "id": "t14_3",
            "question": "Has price reached or is approaching the first critical opposite zone on your map?",
            "yes": {
              "id": "t14_4",
              "action": "INITIATE HEDGE — Open opposing positions at the critical zone",
              "explanation": "When price reaches an opposite zone, open positions in the opposite direction to your original trade. This is Position 2. Use the number of remaining original positions + 1 for the hedge. 'Si me quedan dos aquí, entraré con tres en la cobertura.' This ensures if price continues against your original, you profit more from the hedge than you lose.",
              "quote_es": "Si quiero meter cobertura habrá una posición 2 que será contraria. Ventas.",
              "then": {
                "id": "t14_4a",
                "question": "Have you already secured a partial gain from the initial move?",
                "yes": {
                  "id": "t14_4b",
                  "action": "HEDGE IS FREE — Your partial gain pays for the hedge if it fails",
                  "explanation": "The gain already taken covers the potential loss of the hedge positions if they get stopped. You are now 'working free' — the party is paid by someone else. 'Las posibles stops están pagados por otro que ya le saqué antes.'",
                  "quote_es": "¿Sabes que estoy trabajando gratis? ¿Que la fiesta la paga otro?"
                },
                "no": {
                  "id": "t14_4c",
                  "action": "TAKE A PARTIAL from the initial move FIRST before hedging",
                  "explanation": "Never hedge without first securing some gain from the original move. The partial is what makes the hedge risk-free. Without it, you're doubling exposure."
                }
              }
            },
            "no": {
              "id": "t14_5",
              "question": "Is the potential move distance to the next major zone acceptable for endurance?",
              "yes": {
                "id": "t14_5a",
                "action": "HOLD POSITIONS — Leave at least one position to run to the potential target",
                "explanation": "Always leave at least one position targeting the full potential move. Control the distance; can you endure? 'Ya tengo claro que si pongo una posición, va a consistir en varios disparos, por tanto uno va a ir hasta ahí, seguro.'",
                "quote_es": "Yo observo esa distancia, vamos a suponer que ahí hay, no sé, 400 pips. Vale, los aguanto, perfecto."
              },
              "no": {
                "id": "t14_5b",
                "action": "REDUCE POSITION SIZE — Adjust to be able to endure the full distance"
              }
            }
          },
          "no": {
            "id": "t14_6",
            "action": "DUAL DIRECTION MINDSET — Apply zone indifference principle",
            "explanation": "You don't need to know direction. Be indifferent to all zones. Enter at each zone in the direction it demands. 'Indiferencia total. Me da exactamente igual una que otra. Igual me da, una u otra. Indiferencia total.' Whether price rises or falls, you want to be inside.",
            "quote_es": "Yo no quiero tener razón, yo quiero ganar dinero. La única forma de no querer tener razón y ganar dinero es ir con el precio suba o baje.",
            "then": {
              "id": "t14_6a",
              "question": "At the current zone, what does the zone demand?",
              "yes_label": "Buy zone",
              "no_label": "Sell zone",
              "yes": {
                "id": "t14_6b",
                "action": "BUY at this zone. If price rises, you profit. If it reverses to a sell zone, hedge there.",
                "explanation": "Enter the buy. Keep running a position to potential target. When sell zone appears, add opposing positions. The hedge self-dissolves over time as you take partials. 'Llegó un momento que la cobertura se deshace sola.'"
              },
              "no": {
                "id": "t14_6c",
                "action": "SELL at this zone. If price falls, you profit. If it reverses to a buy zone, hedge there."
              }
            }
          }
        },
        "no": {
          "id": "t14_7",
          "action": "HEDGING REQUIRES MULTIPLE POSITIONS — Use at least 2 positions minimum",
          "explanation": "Hedging cannot work with a single position. You need at least 2, ideally 3-6. One always targets the full potential move; others are used for hedging at opposing zones. 'Cuando yo hablo de coberturas, esto lleva implícito, que voy con varias posiciones. Cuando digo varias, mínimo dos.'"
        }
      },
      "key_principles": [
        {
          "principle": "Zone Indifference",
          "description": "Total detachment from any direction. Buy zone or sell zone, it doesn't matter. You're indifferent to all. Trade whatever the zone demands.",
          "quote_es": "Me desprendo de cualquier zona. Me desprendo de cualquier dirección. Me da igual vender que comprar."
        },
        {
          "principle": "Hedge Self-Dissolves",
          "description": "As you take partials from both directions, the hedge naturally dissolves. Eventually you're left with only one direction — then you set up a new hedge from there.",
          "quote_es": "Llegó un momento que la cobertura se deshace sola."
        },
        {
          "principle": "Hedge Sizing Formula",
          "description": "For the opposing hedge, use: remaining positions from original direction + 1 more. If 2 remain from original, hedge with 3.",
          "quote_es": "Pongo lo que me queda de la primera, más una más."
        },
        {
          "principle": "Constant Hedging",
          "description": "Always maintain a hedge. When one dissolves, immediately prepare for the next. This keeps the curve stable and prevents account drops.",
          "quote_es": "Me quita la preocupación de saber tendencias."
        },
        {
          "principle": "CFDs Are Preferred",
          "description": "CFDs are preferred for hedging because they allow easy opposing positions on the same instrument.",
          "quote_es": "Por eso me gustan los CFDs, por la opción de coberturas."
        }
      ]
    },

    {
      "tree_name": "T15_Deception_Pattern",
      "tree_description": "The Patrón de Engaño (Deception Pattern): recognizing false breakouts, 161.8% reversal zone, stop-then-turn validation. This pattern exploits the moment when big players distribute while retail buys the rally. Source: Deception Pattern video.",
      "source_videos": ["1vfxDbav44U"],
      "root": {
        "id": "t15_1",
        "question": "Is there a strong directional move (rally or crash) that has attracted retail participation?",
        "yes": {
          "id": "t15_2",
          "question": "Has the price STOPPED its directional movement?",
          "note": "Step 1 of reversal: For something to turn, it must first stop. Like a car making a U-turn — first you brake.",
          "quote_es": "Si tú vas conduciendo y quieres dar un giro de 180 grados, lo primero que tienes que hacer es frenar.",
          "yes": {
            "id": "t15_3",
            "question": "Has the price started to TURN (reverse direction)?",
            "note": "Step 2: After stopping, contrary positions begin to dominate. Stops of the original direction get triggered.",
            "yes": {
              "id": "t15_4",
              "question": "Has the turn reached or approached the 161.8% Fibonacci level?",
              "yes": {
                "id": "t15_5",
                "action": "DECEPTION PATTERN CONFIRMED — Anticipate reversal at 161.8%",
                "explanation": "The price stopped, turned, and reached 161.8%. This is the classic deception pattern. The big players distributed during the rally (or accumulated during the crash) while retail was going crazy in the original direction. The 161.8% level is where the deception completes and the real move begins. 'Si el precio respeta el nivel del 161.8, anticipa un giro.'",
                "quote_es": "La gente está loca, loca, loca comprando porque está teniendo un rally magnífico y están comprando, comprando, comprando. Los grandes están aprovechando para distribuir, para vender, vender, vender.",
                "then": {
                  "id": "t15_5a",
                  "question": "Does price respect the 161.8% level and begin reversing?",
                  "yes": {
                    "id": "t15_5b",
                    "action": "ENTER in the reversal direction — The deception is complete, the real move starts now",
                    "explanation": "The pattern is validated. Enter in the direction opposite to the original move. The stops from the original direction are the fuel for the new move."
                  },
                  "no": {
                    "id": "t15_5c",
                    "action": "WAIT — 161.8 not yet respected. Price may continue to 200 level.",
                    "explanation": "If 161.8 doesn't hold, the next level is 200. The deception pattern concept still applies but the target extends."
                  }
                }
              },
              "no": {
                "id": "t15_6",
                "action": "MONITOR — The turn is in progress but hasn't reached the key level yet",
                "explanation": "The stop-then-turn sequence is happening but hasn't reached a tradeable level. Monitor for the 161.8% approach."
              }
            },
            "no": {
              "id": "t15_7",
              "action": "WAIT — Price has stopped but not yet turned. This could be consolidation.",
              "explanation": "Stopping alone is not enough. The price must show directional reversal with contrary position pressure."
            }
          },
          "no": {
            "id": "t15_8",
            "action": "NO DECEPTION PATTERN — The move is still running. Look for exhaustion signs.",
            "explanation": "The deception pattern only activates when the move stops. While the move is in progress, the pattern doesn't apply."
          }
        },
        "no": {
          "id": "t15_9",
          "action": "WAIT for a strong directional move to form — Deception patterns require a prior strong move",
          "explanation": "Without a strong rally or crash that attracted retail traders, there is no deception to exploit."
        }
      },
      "pattern_mechanics": {
        "step_1": "STOP — Something contrary stops the directional move",
        "step_2": "TURN — The price begins reversing as stops of the original direction trigger",
        "step_3": "VALIDATE — The reversal reaches 161.8% Fibonacci level",
        "step_4": "ENTER — If 161.8 is respected, enter in the reversal direction",
        "key_insight": "What you SEE is one thing, what it IS is another. Think Matrix. 'Lo que ves es una cosa y lo que es, es otra. Piensa en Matrix.'"
      }
    },

    {
      "tree_name": "T16_Business_Plan_Compliance",
      "tree_description": "Restaurant analogy framework for trading as a business: consistent menu, positive numerical expectancy, risk-reward minimums, and sequence analysis. Source: Business Plan 3/3, Results Curve, Account Size.",
      "source_videos": ["J-sqjzmntCE", "aY_rYYg3GZ0", "Fr4lEDnT2SM", "CInOSEOYEIg"],
      "root": {
        "id": "t16_1",
        "question": "Do you treat your trading as a business with a defined 'menu' of services?",
        "note": "The restaurant analogy: A restaurant charges 4x its ingredient cost. You must charge the market similarly — your risk-reward must cover costs (losses) and generate profit.",
        "yes": {
          "id": "t16_2",
          "question": "Is your risk-reward ratio at least 1:4 (or higher)?",
          "quote_es": "Si cobras un ratio de 1:4 o superior, maximizas tu potencial.",
          "yes": {
            "id": "t16_3",
            "question": "Have you analyzed your trade sequences for positive numerical expectancy?",
            "note": "With N trades per day, calculate all possible winning/losing combinations. More winning sequences = positive expectancy.",
            "yes": {
              "id": "t16_4",
              "question": "Is your menu consistent (same strategy, same assets, same execution)?",
              "quote_es": "No cambies tu menú de trading. Mantén la consistencia con tu estrategia.",
              "yes": {
                "id": "t16_5",
                "action": "BUSINESS PLAN COMPLIANT — Execute with discipline",
                "explanation": "You have: (1) A defined menu (strategy), (2) Adequate pricing (1:4+ ratio), (3) Positive expectancy, (4) Consistency. Now just execute. The restaurant doesn't change its menu because one customer didn't like the soup.",
                "then": {
                  "id": "t16_5a",
                  "question": "Is your results curve currently favorable or unfavorable?",
                  "yes_label": "Favorable (recent wins)",
                  "no_label": "Unfavorable (recent losses)",
                  "yes": {
                    "id": "t16_5b",
                    "action": "Trade with standard or slightly increased aggression — the curve supports it",
                    "explanation": "When the results curve is favorable, your generic methodology works. Execute normally. Context assessment (T18) may allow slightly higher volume."
                  },
                  "no": {
                    "id": "t16_5c",
                    "action": "PROTECT THE CURVE — Reduce aggression, use T18 context rules",
                    "explanation": "When the results curve is unfavorable, adjust. Reduce lot sizes, be more selective, protect the curve from further damage. 'Si tu curva de resultados cae mucho, es por tu culpa.' The curve falling is always the trader's responsibility — adapt.",
                    "quote_es": "Si tu curva de resultados cae mucho, es por tu culpa."
                  }
                }
              },
              "no": {
                "id": "t16_6",
                "action": "STOP CHANGING YOUR MENU — Consistency is the foundation of a trading business",
                "explanation": "Don't change strategies every week. Stick with your defined approach. 'Evita cambiar tu menú de trading.' A restaurant that changes its menu daily has no loyal customers. Your strategy needs repetition to generate statistical edge."
              }
            },
            "no": {
              "id": "t16_7",
              "action": "ANALYZE SEQUENCES — Calculate all possible win/loss combinations for your daily trade count",
              "explanation": "If you do 3 trades/day with 1:4 ratio, calculate: WWW, WWL, WLW, LWW, WLL, LWL, LLW, LLL. Count how many are net positive. You need MORE positive sequences than negative ones. If not, adjust the ratio upward (1:5, 1:6).",
              "quote_es": "Tener más secuencias ganadoras que perdedoras para asegurar una expectativa numérica positiva."
            }
          },
          "no": {
            "id": "t16_8",
            "action": "INCREASE YOUR RATIO — Minimum 1:4 to survive, 1:5+ for guaranteed profitability",
            "explanation": "At 1:4, you need to win only 1 out of 4 trades to break even. At 1:5+, even bad streaks don't destroy the account. Below 1:4, you're the restaurant selling at cost — no margin for error.",
            "quote_es": "Para que funcione necesitas un ratio mínimo de 1:4. Con 1:5 o superior, tienes garantía."
          }
        },
        "no": {
          "id": "t16_9",
          "action": "BUILD YOUR BUSINESS PLAN — Trading is a business, not gambling",
          "explanation": "Define: (1) Your 'menu' — what trades you take and how, (2) Your 'pricing' — risk-reward ratio, (3) Your 'operating costs' — maximum drawdown tolerance, (4) Your 'hours of operation' — when you trade. Without this, you have no business.",
          "then": {
            "id": "t16_9a",
            "action": "EVALUATE TIME-SPACE-REWARD RELATIONSHIP",
            "explanation": "Like choosing between job offers in different cities, evaluate each trade type by: time invested, psychological cost, and potential reward. Not every trade is worth taking even if it's profitable on paper. Find what fits YOUR life. 'Evalúa cada operación basándote en tu tiempo personal y aspectos de coste.'"
          }
        }
      }
    },

    {
      "tree_name": "T17_Drawdown_Management",
      "tree_description": "Specific protocols for managing drawdown: 15% threshold, 22.5% reflection point, segment trading, 5% cushion principle. Source: Drawdown Debate (Joaquín Vega, Pablo Ortiz, Víctor Gómez).",
      "source_videos": ["1YCSx7gXPF0"],
      "root": {
        "id": "t17_1",
        "question": "What is your current drawdown from initial capital?",
        "sub_tree": {
          "id": "t17_1a",
          "question": "Is drawdown less than 5%?",
          "yes": {
            "id": "t17_2",
            "action": "NORMAL TRADING — All systems go. Execute your business plan normally.",
            "explanation": "Drawdown under 5% is entirely normal. No adjustments needed. Trade at your standard lot sizes and risk parameters."
          },
          "no": {
            "id": "t17_3",
            "question": "Is drawdown between 5% and 15%?",
            "yes": {
              "id": "t17_4",
              "action": "CAUTION ZONE — Reduce aggression, evaluate what's going wrong",
              "explanation": "You're in an extended drawdown. Review recent trades for pattern violations. Reduce lot sizes by 20-50%. Focus on high-conviction setups only. Stop taking marginal trades.",
              "then": {
                "id": "t17_4a",
                "question": "Do you have a 5% gain cushion above initial capital?",
                "yes": {
                  "id": "t17_4b",
                  "action": "The cushion gives you room — trade with adjusted aggressiveness",
                  "explanation": "A 5% cushion means your drawdown from peak is larger but you're still above initial capital. Use this cushion wisely. 'Ajusta la agresividad basándote en un colchón de ganancia del 5%.'",
                  "quote_es": "Ajusta la agresividad basándote en un colchón de ganancia del 5%."
                },
                "no": {
                  "id": "t17_4c",
                  "action": "NO CUSHION — Trade conservatively. Minimum lot sizes. Only best setups."
                }
              }
            },
            "no": {
              "id": "t17_5",
              "question": "Is drawdown between 15% and 22.5%?",
              "yes": {
                "id": "t17_6",
                "action": "STOP TRADING — Analyze and recalibrate",
                "explanation": "At 15% drawdown from initial capital, STOP. Do not place any more trades. Go back to analysis: What changed? Assets? Personal condition? Method execution? Return to demo if needed. 'Nunca permitas que el drawdown exceda el 15% de tu capital inicial sin intervención.'",
                "quote_es": "Deja de operar y analiza la situación, potencialmente vuelve a demo.",
                "then": {
                  "id": "t17_6a",
                  "action": "IMPLEMENT SEGMENT TRADING",
                  "explanation": "Divide your account into segments. Change your approach based on which segment you're in. Lower segments = lower risk, fewer trades, smaller lots. This prevents the death spiral of trying to recover by trading bigger. 'El trading por segmentos significa cambiar las acciones según segmentos específicos del rendimiento de la cuenta.'"
                }
              },
              "no": {
                "id": "t17_7",
                "question": "Is drawdown at or above 22.5%?",
                "yes": {
                  "id": "t17_8",
                  "action": "CRITICAL REFLECTION POINT — Consider extended break (up to 6 months)",
                  "explanation": "At 22.5% drawdown, recovery becomes mathematically very difficult. A trader needs to gain 30%+ just to get back to initial. Consider: (1) Take a 6-month break from live trading, (2) Return to demo exclusively, (3) Completely reassess methodology, (4) Address any psychological or personal issues. 'Si el drawdown total llega al 22.5%, se necesita un periodo prolongado de recuperación; sugiere un descanso de 6 meses.'",
                  "quote_es": "Un drawdown del 30% total indica un rendimiento pobre, y recuperarse se vuelve tremendamente complicado."
                },
                "no": {
                  "id": "t17_9",
                  "action": "ABOVE 30% — The account is in critical condition",
                  "explanation": "Recovery from 30%+ drawdown is statistically near-impossible with the same approach. The account needs either: (1) Fresh capital injection after a complete reset, or (2) Extended demo period of 6-12 months, or (3) Complete methodology change. Do not continue throwing money at a broken approach."
                }
              }
            }
          }
        }
      },
      "segment_trading_framework": {
        "description": "Divide your trading into segments based on account performance. Each segment has different rules.",
        "segments": [
          {
            "name": "Growth Segment",
            "condition": "Account above initial capital + 5% cushion",
            "rules": "Standard lot sizes, full strategy, can attempt aggressive setups"
          },
          {
            "name": "Normal Segment",
            "condition": "Account at or slightly above initial capital (0-5%)",
            "rules": "Standard lot sizes, full strategy, no extra aggression"
          },
          {
            "name": "Caution Segment",
            "condition": "Account 0-10% below initial capital",
            "rules": "Reduced lot sizes (50-75% of standard), high-conviction setups only"
          },
          {
            "name": "Danger Segment",
            "condition": "Account 10-15% below initial capital",
            "rules": "Minimum lot sizes (25-50%), best setups only, consider demo"
          },
          {
            "name": "Stop Segment",
            "condition": "Account more than 15% below initial capital",
            "rules": "STOP live trading. Return to demo. Full reassessment required."
          }
        ]
      }
    },

    {
      "tree_name": "T18_Context_Assessment",
      "tree_description": "How to evaluate context quality (good/regular/weak), adjust lot sizes accordingly, and weight pattern significance. Not all setups are equal — context determines aggression level. Source: Context Always Commands, Results Curve, Intraday Trading Example.",
      "source_videos": ["HLVeiM-z1S0", "aY_rYYg3GZ0", "5jrIu_WmAsY"],
      "root": {
        "id": "t18_1",
        "question": "Have you evaluated the current context quality?",
        "yes": {
          "id": "t18_2",
          "question": "Is the context GOOD (first attempt at the zone, clean pattern, strong left-side confirmation)?",
          "yes": {
            "id": "t18_3",
            "action": "GOOD CONTEXT — Trade with full lot size (high volume)",
            "explanation": "When context is good, you have a first attempt at a clean zone with strong confirmation from the left side of the chart. Use your full planned lot size. This is the time to be aggressive. 'Un contexto inicial bueno con lotaje alto — mantén el lotaje actual y espera cambios significativos.'",
            "quote_es": "Mantén el lotaje actual y espera cambios significativos.",
            "then": {
              "id": "t18_3a",
              "question": "Does the price break important levels while in this good context?",
              "yes": {
                "id": "t18_3b",
                "action": "Context may be upgrading — consider adding slightly more volume",
                "explanation": "If price breaks important highs/lows in a good context, the setup is strengthening. You may add volume carefully."
              },
              "no": {
                "id": "t18_3c",
                "action": "Maintain current volume — no changes needed in good context"
              }
            }
          },
          "no": {
            "id": "t18_4",
            "question": "Is the context REGULAR (second attempt, some conflicting signals, partial confirmation)?",
            "yes": {
              "id": "t18_5",
              "action": "REGULAR CONTEXT — Trade with reduced lot size (medium volume)",
              "explanation": "Second attempt at a zone or mixed signals. Reduce lot size to 50-75% of standard. The setup has merit but lower probability. 'En un contexto regular, considera añadir un poco más solo si el precio rompe máximos importantes.'",
              "quote_es": "En un contexto regular, considera añadir un poco más solo si el precio rompe máximos importantes.",
              "then": {
                "id": "t18_5a",
                "question": "Does the price break important levels, potentially improving context?",
                "yes": {
                  "id": "t18_5b",
                  "action": "Context improving — may cautiously add a small amount of volume"
                },
                "no": {
                  "id": "t18_5c",
                  "action": "Maintain reduced volume — regular context stays regular"
                }
              }
            },
            "no": {
              "id": "t18_6",
              "action": "WEAK CONTEXT — Trade with minimum lot size or skip entirely",
              "explanation": "Third attempt, failed patterns, weak signals, or conflicting left-side information. If you trade at all, use minimum lot size (25% of standard). Better to skip. 'La presencia de un segundo patrón fallido — evalúa el contexto como débil ya que hay señal de debilidad.'",
              "quote_es": "La presencia de un segundo patrón fallido — evalúa el contexto como débil ya que hay señal de debilidad.",
              "then": {
                "id": "t18_6a",
                "question": "Is your results curve also unfavorable?",
                "yes": {
                  "id": "t18_6b",
                  "action": "SKIP THIS TRADE — Weak context + bad curve = high risk of further drawdown",
                  "explanation": "When context is weak AND your results curve is falling, the smart play is to sit out. Protect the curve. The next good context will come."
                },
                "no": {
                  "id": "t18_6c",
                  "action": "MINIMUM LOT only — Take the trade at smallest size if you must"
                }
              }
            }
          }
        },
        "no": {
          "id": "t18_7",
          "action": "ASSESS CONTEXT BEFORE EVERY TRADE — This is non-negotiable",
          "explanation": "Context assessment must happen before every trade. Check: (1) How many attempts at this zone? (2) Have patterns failed here before? (3) What does the left side show? (4) What is your results curve status? 'El contexto siempre manda.' Context is always king — it determines everything.",
          "quote_es": "El contexto siempre manda."
        }
      },
      "context_quality_criteria": {
        "good": {
          "attempts": "First attempt at the zone",
          "patterns": "Clean, unfailed patterns",
          "left_side": "Strong confirmation from historical data",
          "lot_adjustment": "100% of planned lot size"
        },
        "regular": {
          "attempts": "Second attempt at the zone",
          "patterns": "One prior failure or mixed signals",
          "left_side": "Partial confirmation",
          "lot_adjustment": "50-75% of planned lot size"
        },
        "weak": {
          "attempts": "Third+ attempt or multiple failures",
          "patterns": "Two or more failed patterns",
          "left_side": "Conflicting or no confirmation",
          "lot_adjustment": "0-25% of planned lot size (consider skipping)"
        }
      }
    },

    {
      "tree_name": "T19_Null_Operations",
      "tree_description": "When and how to exit at breakeven (null operations), imbalance level detection, and stress reduction via early exits. Null operations are a proactive decision to avoid pain, not a failure. Source: Null Operations video, Many Ways to Win and Lose.",
      "source_videos": ["S7pK5Oj6kyo", "6U91ZG1e80g"],
      "root": {
        "id": "t19_1",
        "question": "Is the trade currently active but showing concerning price behavior?",
        "yes": {
          "id": "t19_2",
          "question": "Is the price rise/fall showing weakness (imbalance level detected)?",
          "note": "An imbalance level is when price is pushed with effort but lacks underlying strength — an unsustainable move.",
          "yes": {
            "id": "t19_3",
            "question": "Are your positions currently near breakeven or slight profit?",
            "yes": {
              "id": "t19_4",
              "action": "EXIT AS NULL OPERATION — Close all positions at breakeven",
              "explanation": "The price movement is weak. It was pushed with effort but lacks conviction. Rather than waiting for it to become a loser, exit now at breakeven. This is a proactive decision that reduces stress and protects capital. 'Sal de la operación cuando el movimiento del precio es débil, incluso si significa renunciar a beneficio potencial.'",
              "quote_es": "Sal de la operación cuando el movimiento del precio es débil, incluso si significa renunciar a beneficio potencial.",
              "then": {
                "id": "t19_4a",
                "action": "LOG AS NULL OPERATION in your trading journal",
                "explanation": "A null operation is a valid trade classification. It is NOT a failure. It is active risk management. You chose to not let the market dictate your exit — you took control. 'Reduce el estrés decidiendo cuándo entrar y salir basándote en criterios personales en lugar de la presión del mercado.'"
              }
            },
            "no": {
              "id": "t19_5",
              "question": "Are positions in small profit (positive territory)?",
              "yes": {
                "id": "t19_5a",
                "action": "Consider POSITIVE EXIT — Exit with small gain rather than risking it becoming a loss",
                "explanation": "If positions are in small profit but price is showing weakness, exiting with a small gain is preferable to watching it reverse into a loss. This becomes a 'positive trade' per T6 classification."
              },
              "no": {
                "id": "t19_5b",
                "question": "Are positions in small loss (less than full stop)?",
                "yes": {
                  "id": "t19_5c",
                  "action": "EXIT EARLY as NULL TRADE — Loss less than maximum per business plan",
                  "explanation": "Better to take a small loss now than the full stop later. The price is showing weakness and has no intention of reversing in your favor. 'Yo no permito que me saque el stop completo.' Cut early, live to trade another day.",
                  "quote_es": "Yo no permito que me saque el stop completo."
                },
                "no": {
                  "id": "t19_5d",
                  "action": "HOLD or EXIT per standard management rules — not a null operation scenario"
                }
              }
            }
          },
          "no": {
            "id": "t19_6",
            "question": "Is the price moving against you rapidly with clear intent?",
            "yes": {
              "id": "t19_6a",
              "action": "EXIT IMMEDIATELY — This is pattern invalidation, not a null operation",
              "explanation": "If the price is moving strongly against you with clear intent, this is not a null operation — this is pattern invalidation. Exit immediately, don't wait for the stop. 'Sal de la operación inmediatamente si el precio invalida el patrón de entrada.'"
            },
            "no": {
              "id": "t19_6b",
              "action": "HOLD — Price movement is normal. Continue with standard management (T7).",
              "explanation": "Not every adverse movement is cause for a null exit. If price is moving normally within expected parameters, let the trade play out per your management rules."
            }
          }
        },
        "no": {
          "id": "t19_7",
          "action": "No concerning behavior — Continue monitoring per standard management rules",
          "explanation": "If the trade is performing as expected, continue with your T7 management rules. Null operations are only considered when price behavior raises red flags."
        }
      },
      "imbalance_detection_criteria": [
        "Price is rising/falling on low volume or weak candle patterns",
        "Each push requires more effort for less result",
        "Price cannot hold gains/losses — quick reversals within candles",
        "Spread is widening, indicating reduced liquidity",
        "Price reaches a level but immediately retreats (wick-heavy candles)"
      ],
      "psychological_benefit": "Null operations reduce accumulated trading stress. The trader reclaims control by deciding exits based on personal criteria rather than market pressure. 'Reduce el estrés decidiendo cuándo entrar y salir basándote en criterios personales en lugar de la presión del mercado.'"
    }
  ],

  "cross_references": {
    "T1_feeds_T2": "Cycle identification (T1) is the prerequisite for understanding evolution (T2). You cannot evaluate evolution without first having an active cycle.",
    "T2_feeds_T5": "Evolution/break outcomes (T2) inform entry strategy (T5). A broken cycle creates new points of control; an evolved cycle creates new zones to trade.",
    "T3_validates_T1": "Retracement completion (T3) confirms that a new fractal's impulse has begun, which feeds back into cycle identification (T1) for the next level.",
    "T4_before_T5": "Context reading (T4) MUST happen before entry strategy (T5). The reading model positions you; the attack model executes.",
    "T5_feeds_T7": "Entry strategy (T5) determines which management approach (T7) to use. Zone confluences may warrant super-winner attempts; weaker entries get fixed-ratio management.",
    "T6_driven_by_T7": "Trade classification (T6) is the result of how management (T7) plays out. The five outcomes emerge from how you handle the trade after entry.",
    "T8_within_T7": "Partial strategy (T8) is a sub-component of post-entry management (T7). The two trees work together.",
    "T9_special_case_of_T4": "The 161-200 zone trading (T9) is a specific context scenario (T4) that requires its own decision framework due to asset-class differences.",
    "T10_constrains_all": "Risk and business plan (T10) constrains ALL other trees. No trade happens without business plan compliance.",
    "T11_is_the_meta": "Method architecture (T11) is the meta-tree that explains how all other trees fit together.",
    "T12_extends_T7": "Super-winner psychology (T12) extends post-entry management (T7) for experienced traders only.",
    "T13_improves_all": "Chart analysis methodology (T13) is the training framework that improves execution of all other trees.",
    "T14_complements_T7": "Hedging (T14) is an alternative/complement to standard post-entry management (T7). It provides direction-independent profit opportunities.",
    "T15_feeds_T5": "Deception pattern (T15) provides a specific entry signal for the attack model (T5). The 161.8% reversal zone is a high-conviction entry.",
    "T16_constrains_all": "Business plan compliance (T16) works alongside T10 to ensure the trading business is viable. Positive expectancy must exist before any trade.",
    "T17_extends_T10": "Drawdown management (T17) is the crisis response protocol for T10 (Risk). When risk thresholds are breached, T17 takes over.",
    "T18_before_T5": "Context assessment (T18) must happen alongside T4 (Context Reading) before any entry (T5). It determines lot sizing for the specific trade.",
    "T19_extends_T6_T7": "Null operations (T19) add a proactive exit option to management (T7) and classification (T6). They bridge the gap between holding and stopping out."
  },

  "execution_flow": [
    "1. T10/T16 — Verify business plan compliance and risk parameters are set",
    "2. T17 — Check current drawdown level and apply appropriate segment rules",
    "3. T11 — Confirm you have all three layers (reading + attack + management)",
    "4. T13 — Study charts using past-reviewed method to build skill",
    "5. T1 — Identify cycles on the current chart",
    "6. T4/T18 — Read context from left side of chart AND assess context quality (good/regular/weak)",
    "7. T2 — Evaluate if current cycles have evolved or broken",
    "8. T3 — Verify retracement completion for active fractals",
    "9. T9 — If in 161-200 zone, apply special handling",
    "10. T15 — Check for deception patterns (false breakouts approaching 161.8%)",
    "11. T5 — Execute entry strategy based on reading model output (with minimum stop rules)",
    "12. T7/T8 — Manage trade post-entry (stops, partials, divided positions)",
    "13. T14 — Apply hedging strategy if using multiple positions",
    "14. T19 — Monitor for null operation conditions (weak price action, imbalance levels)",
    "15. T12 — If applicable, hold for super-winner (understanding methods are triggers)",
    "16. T6 — Classify trade outcome and log for business plan tracking"
  ]
}
